{
  "backend/main.mo": "Minimal Motoko canister actor with no methods or state.",
  "feature_evidence.json": "Feature evidence report listing implemented features, associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Plain-text map of frontend file paths to short functional summaries for build reference.",
  "frontend/index.css": "Tailwind base styles and custom warm-toned OKLCH theme variables for light and dark modes.",
  "frontend/index.html": "Main HTML entry point setting metadata, fonts, and mounting the React app.",
  "frontend/src/App.tsx": "Root React component handling hash-based routing and wrapping pages in MainLayout.",
  "frontend/src/components/sections/DepartmentsGrid.tsx": "Renders a grid of department cards using typed data with optional limiting.",
  "frontend/src/components/sections/EventsList.tsx": "Displays a filterable events/news list with formatted dates and category badges.",
  "frontend/src/components/site/Footer.tsx": "Site footer with branding, social links, quick links, programs list, and contact details from config.",
  "frontend/src/components/site/Header.tsx": "Responsive header with utility bar, branding, and mobile/desktop navigation driven by siteConfig.",
  "frontend/src/components/site/MainLayout.tsx": "Layout component adding shared header, footer, and page structure.",
  "frontend/src/content/departments.ts": "Defines Department type and a list of department metadata for display.",
  "frontend/src/content/events.ts": "Defines Event type and a list of events, news, and achievements.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context with login, logout, and identity persistence using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file exporting nothing.",
  "frontend/src/index.css": "Tailwind CSS setup with custom light/dark theme variables and base styling.",
  "frontend/src/main.tsx": "Entry point mounting the app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with mission, vision, and core values sections.",
  "frontend/src/pages/AcademicsPage.tsx": "Renders the Academics page with academic highlights and a departments grid.",
  "frontend/src/pages/AdmissionsPage.tsx": "Renders the admissions page with process steps and FAQs using cards and accordions.",
  "frontend/src/pages/ContactPage.tsx": "Displays institute contact details from config and a simple non-submitting inquiry form.",
  "frontend/src/pages/HomePage.tsx": "Implements the home page with a hero banner, stats, program previews, and events section.",
  "frontend/src/pages/NewsEventsPage.tsx": "Shows categorized news and events using tabbed navigation and the EventsList component.",
  "frontend/src/pages/PlacementsPage.tsx": "Provides placement statistics, top recruiters, and support details through cards and badges.",
  "frontend/src/siteConfig.ts": "Defines global site branding, contact info, address, social links, and map URL.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and content paths with plugin integrations.",
  "project_state.json": "Defines project version, goals, image needs, and required features for building a rebranded clone-style college website. Lists existing features, configuration expectations, and structured content requirements."
}